## Staging: redis
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 7 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                         NAME                         |
|--------|------------------------------------------------------|
| add    | `aws_cloudwatch_log_group.weblate_redis_engine_logs` |
|        | `aws_cloudwatch_log_group.weblate_redis_slow_logs`   |
|        | `aws_elasticache_replication_group.weblate`          |
|        | `aws_elasticache_subnet_group.weblate`               |
|        | `aws_ssm_parameter.weblate_redis_auth_token`         |
|        | `aws_ssm_parameter.weblate_redis_throttle_url`       |
|        | `aws_ssm_parameter.weblate_redis_url`                |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.weblate_redis_engine_logs will be created
  + resource "aws_cloudwatch_log_group" "weblate_redis_engine_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/elasticache/weblate/engine-logs"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + tags_all          = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
    }

  # aws_cloudwatch_log_group.weblate_redis_slow_logs will be created
  + resource "aws_cloudwatch_log_group" "weblate_redis_slow_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/elasticache/weblate/slow-logs"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + tags_all          = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
    }

  # aws_elasticache_replication_group.weblate will be created
  + resource "aws_elasticache_replication_group" "weblate" {
      + apply_immediately              = false
      + arn                            = (known after apply)
      + at_rest_encryption_enabled     = true
      + auth_token                     = (sensitive value)
      + auto_minor_version_upgrade     = (known after apply)
      + automatic_failover_enabled     = true
      + cluster_enabled                = (known after apply)
      + configuration_endpoint_address = (known after apply)
      + data_tiering_enabled           = (known after apply)
      + description                    = "Weblate multi-AZ cluster"
      + engine                         = "redis"
      + engine_version                 = "7.0"
      + engine_version_actual          = (known after apply)
      + global_replication_group_id    = (known after apply)
      + id                             = (known after apply)
      + maintenance_window             = "sun:04:00-sun:05:00"
      + member_clusters                = (known after apply)
      + multi_az_enabled               = true
      + node_type                      = "cache.t3.micro"
      + num_cache_clusters             = 3
      + num_node_groups                = (known after apply)
      + parameter_group_name           = "default.redis7"
      + port                           = 6379
      + preferred_cache_cluster_azs    = [
          + "ca-central-1d",
          + "ca-central-1a",
          + "ca-central-1b",
        ]
      + primary_endpoint_address       = (known after apply)
      + reader_endpoint_address        = (known after apply)
      + replicas_per_node_group        = (known after apply)
      + replication_group_id           = "weblate-staging"
      + security_group_ids             = [
          + "sg-0dc0c7ba8d93ffe7b",
        ]
      + security_group_names           = (known after apply)
      + snapshot_window                = (known after apply)
      + subnet_group_name              = "weblate-staging"
      + tags                           = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + tags_all                       = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + transit_encryption_enabled     = true

      + log_delivery_configuration {
          + destination      = "/aws/elasticache/weblate/engine-logs"
          + destination_type = "cloudwatch-logs"
          + log_format       = "json"
          + log_type         = "engine-log"
        }
      + log_delivery_configuration {
          + destination      = "/aws/elasticache/weblate/slow-logs"
          + destination_type = "cloudwatch-logs"
          + log_format       = "json"
          + log_type         = "slow-log"
        }
    }

  # aws_elasticache_subnet_group.weblate will be created
  + resource "aws_elasticache_subnet_group" "weblate" {
      + arn         = (known after apply)
      + description = "Weblate cluster subnet group"
      + id          = (known after apply)
      + name        = "weblate-staging"
      + subnet_ids  = [
          + "subnet-03ef974782a885a9f",
          + "subnet-05ec193725a0c9e5e",
          + "subnet-06cacbbeb98a04d71",
        ]
      + tags        = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + tags_all    = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
    }

  # aws_ssm_parameter.weblate_redis_auth_token will be created
  + resource "aws_ssm_parameter" "weblate_redis_auth_token" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "weblate-redis-auth_token"
      + tags           = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.weblate_redis_throttle_url will be created
  + resource "aws_ssm_parameter" "weblate_redis_throttle_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "weblate-redis-throttle-url"
      + tags           = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.weblate_redis_url will be created
  + resource "aws_ssm_parameter" "weblate_redis_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "weblate-redis-url"
      + tags           = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + weblate_redis_auth_token_secret_arn   = (known after apply)
  + weblate_redis_throttle_url_secret_arn = (known after apply)
  + weblate_redis_url_secret_arn          = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
